In [1610]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import glob
import re
import math
import statistics as st

In [1611]:

import warnings
warnings.filterwarnings("ignore")

In [1612]:
v=np.array([1,2,3,4,5,6,7,8])
s1=pd.Series(v)
s1

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
dtype: int64

In [1613]:
s1.dtype

dtype('int64')

In [1614]:
s1.values.itemsize

8

In [1615]:
s1.nbytes

64

In [1616]:
s1.shape

(8,)

In [1617]:
s1.ndim

1

In [1618]:
len(s1)

8

In [1619]:
s1.count()

np.int64(8)

In [1620]:

s1.size

8

In [1621]:
s2 = pd.Series([1,2,3],index = ['a','b','c',])
s2

a    1
b    2
c    3
dtype: int64

In [1622]:
s1.index = ['a' , 'b' , 'c' , 'd' , 'e' , 'f' , 'g' , 'h']
s1

a    1
b    2
c    3
d    4
e    5
f    6
g    7
h    8
dtype: int64

In [1623]:
v2 = np.random.random(10)
ind2 = np.arange(0,10)
s = pd.Series(v2,ind2)
v2 , ind2 , s

(array([0.3204301 , 0.31463545, 0.24251256, 0.50703145, 0.84055553,
        0.44030484, 0.96295614, 0.5850288 , 0.44999268, 0.31655295]),
 array([0, 1, 2, 3, 4, 5, 6, 7, 8, 9]),
 0    0.320430
 1    0.314635
 2    0.242513
 3    0.507031
 4    0.840556
 5    0.440305
 6    0.962956
 7    0.585029
 8    0.449993
 9    0.316553
 dtype: float64)

In [1624]:
dict1= {'a1': 10, 'b': 20, 'c' : 30, 'd' : 40}
s3=pd.Series(dict1)
s3

a1    10
b     20
c     30
d     40
dtype: int64

In [1625]:
pd.Series(99, index=[0, 1, 2, 3, 4, 5])

0    99
1    99
2    99
3    99
4    99
5    99
dtype: int64

In [1626]:

s

0    0.320430
1    0.314635
2    0.242513
3    0.507031
4    0.840556
5    0.440305
6    0.962956
7    0.585029
8    0.449993
9    0.316553
dtype: float64

In [1627]:
s[1:5]

1    0.314635
2    0.242513
3    0.507031
4    0.840556
dtype: float64

In [1628]:
s[-1:]

9    0.316553
dtype: float64

In [1629]:
s[:4]

0    0.320430
1    0.314635
2    0.242513
3    0.507031
dtype: float64

In [1630]:
s[:-1]

0    0.320430
1    0.314635
2    0.242513
3    0.507031
4    0.840556
5    0.440305
6    0.962956
7    0.585029
8    0.449993
dtype: float64

In [1631]:
s[-1:]

9    0.316553
dtype: float64

In [1632]:
s[-3:-1]

7    0.585029
8    0.449993
dtype: float64

In [1633]:
s2=s1.copy()
s2

a    1
b    2
c    3
d    4
e    5
f    6
g    7
h    8
dtype: int64

In [1634]:
s3

a1    10
b     20
c     30
d     40
dtype: int64

In [1635]:
s4 = pd.concat([s1, s2])
s4

a    1
b    2
c    3
d    4
e    5
f    6
g    7
h    8
a    1
b    2
c    3
d    4
e    5
f    6
g    7
h    8
dtype: int64

In [1636]:
s4.drop('b' , inplace=False)

a    1
c    3
d    4
e    5
f    6
g    7
h    8
a    1
c    3
d    4
e    5
f    6
g    7
h    8
dtype: int64

In [1637]:
s4

a    1
b    2
c    3
d    4
e    5
f    6
g    7
h    8
a    1
b    2
c    3
d    4
e    5
f    6
g    7
h    8
dtype: int64

In [1638]:
s4 = pd.concat([s4, pd.Series({'d': 7})])
s4

a    1
b    2
c    3
d    4
e    5
f    6
g    7
h    8
a    1
b    2
c    3
d    4
e    5
f    6
g    7
h    8
d    7
dtype: int64

In [1639]:
v1 = np.array([10, 20, 30, 40])
v2= np.array([1,2,3,4])
s1=pd.Series(v1)
s2=pd.Series(v2)
s1 , s2

(0    10
 1    20
 2    30
 3    40
 dtype: int64,
 0    1
 1    2
 2    3
 3    4
 dtype: int64)

In [1640]:
s1.add(s2)

0    11
1    22
2    33
3    44
dtype: int64

In [1641]:
s1.sub(s2)

0     9
1    18
2    27
3    36
dtype: int64

In [1642]:
s1.mul(s2)

0     10
1     40
2     90
3    160
dtype: int64

In [1643]:
s1.div(s2)

0    10.0
1    10.0
2    10.0
3    10.0
dtype: float64

In [1644]:
s1.max()

np.int64(40)

In [1645]:
s1.min()

np.int64(10)

In [1646]:
s1.mean()

np.float64(25.0)

In [1647]:
s1.equals(s2)

False

In [1648]:
s1.std()

np.float64(12.909944487358056)

In [1649]:
s1.median()

np.float64(25.0)

In [1650]:
s1.mode()

0    10
1    20
2    30
3    40
dtype: int64

In [1651]:
s5= pd.Series([1,1,2,2,3,3,4,4], index=[1,2,3,4,5,6,7,8])
s5

1    1
2    1
3    2
4    2
5    3
6    3
7    4
8    4
dtype: int64

In [1652]:
s5.value_counts()

1    2
2    2
3    2
4    2
Name: count, dtype: int64

In [1653]:
df = pd.DataFrame()
df

Empty DataFrame
Columns: []
Index: []

In [1654]:
lang = ['Java', 'Python', 'C', 'C++', 'Rust']
df = pd.DataFrame(lang)
df

        0
0    Java
1  Python
2       C
3     C++
4    Rust

In [1655]:
rating = [1,2,3,4,5]
df[1]= rating
df

        0  1
0    Java  1
1  Python  2
2       C  3
3     C++  4
4    Rust  5

In [1656]:
df.columns= ['PRG LANG', 'Rating']
df

  PRG LANG  Rating
0     Java       1
1   Python       2
2        C       3
3      C++       4
4     Rust       5

In [1657]:
data =[{'a' : 1, 'b': 2}, {'a': 5, 'b': 10, 'c': 20}]
df2= pd.DataFrame(data)
df3= pd.DataFrame(data, index=['row 1','row 2'], columns=['a' , 'b'])
df4= pd.DataFrame(data, index=['row 1','row 2'], columns=['a' , 'b' , 'c'])
df5= pd.DataFrame(data, index=['row 1','row 2'], columns=['a' , 'b' , 'c' , 'd'])
df2

   a   b     c
0  1   2   NaN
1  5  10  20.0

In [1658]:
df3

       a   b
row 1  1   2
row 2  5  10

In [1659]:
df4

       a   b     c
row 1  1   2   NaN
row 2  5  10  20.0

In [1660]:
df5

       a   b     c   d
row 1  1   2   NaN NaN
row 2  5  10  20.0 NaN

In [1661]:
df0=pd.DataFrame({'ID': [1,2,3,4] , 'Name' : ['Panshul' , 'Vikram' , 'Aggarwal' , 'is awesome']})
df0

   ID        Name
0   1     Panshul
1   2      Vikram
2   3    Aggarwal
3   4  is awesome

In [1662]:
dict= {'A' : pd.Series([1,2,3], index=['a' , 'b' , 'c']),
        'B' : pd.Series([1,2,3,4], index=['a' , 'b' , 'c' , 'd'])}
df1=pd.DataFrame(dict)
df1

     A  B
a  1.0  1
b  2.0  2
c  3.0  3
d  NaN  4

In [1663]:
dates=pd.date_range(start='28-05-2025' , end='31-05-2025')
dates

DatetimeIndex(['2025-05-28', '2025-05-29', '2025-05-30', '2025-05-31'], dtype='datetime64[ns]', freq='D')

In [1664]:
MP=np.random.random((4,4))
MP

array([[0.50516787, 0.44846095, 0.41960249, 0.91699856],
       [0.45585234, 0.42072227, 0.886671  , 0.90395913],
       [0.12018525, 0.89252327, 0.11025687, 0.84709614],
       [0.81243812, 0.75118216, 0.320543  , 0.44860733]])

In [1665]:
dframe=pd.DataFrame(MP, index=dates)
dframe

                   0         1         2         3
2025-05-28  0.505168  0.448461  0.419602  0.916999
2025-05-29  0.455852  0.420722  0.886671  0.903959
2025-05-30  0.120185  0.892523  0.110257  0.847096
2025-05-31  0.812438  0.751182  0.320543  0.448607

In [1666]:
dframe.columns=['C1' , 'C2' , 'C3' , 'C4']
dframe

                  C1        C2        C3        C4
2025-05-28  0.505168  0.448461  0.419602  0.916999
2025-05-29  0.455852  0.420722  0.886671  0.903959
2025-05-30  0.120185  0.892523  0.110257  0.847096
2025-05-31  0.812438  0.751182  0.320543  0.448607

In [1667]:
dframe.index

DatetimeIndex(['2025-05-28', '2025-05-29', '2025-05-30', '2025-05-31'], dtype='datetime64[ns]', freq='D')

In [1668]:
dframe.columns

Index(['C1', 'C2', 'C3', 'C4'], dtype='object')

In [1669]:
dframe.dtypes

C1    float64
C2    float64
C3    float64
C4    float64
dtype: object

In [1670]:
dframe.sort_values(by='C1')

                  C1        C2        C3        C4
2025-05-30  0.120185  0.892523  0.110257  0.847096
2025-05-29  0.455852  0.420722  0.886671  0.903959
2025-05-28  0.505168  0.448461  0.419602  0.916999
2025-05-31  0.812438  0.751182  0.320543  0.448607

In [1671]:
dframe.sort_values(by='C4' ,ascending=False)

                  C1        C2        C3        C4
2025-05-28  0.505168  0.448461  0.419602  0.916999
2025-05-29  0.455852  0.420722  0.886671  0.903959
2025-05-30  0.120185  0.892523  0.110257  0.847096
2025-05-31  0.812438  0.751182  0.320543  0.448607

In [1672]:
df1

     A  B
a  1.0  1
b  2.0  2
c  3.0  3
d  NaN  4

In [1673]:
del df1['B']

In [1674]:
df1

     A
a  1.0
b  2.0
c  3.0
d  NaN

In [1675]:
df5.pop('d')

row 1   NaN
row 2   NaN
Name: d, dtype: float64

In [1676]:
df5

       a   b     c
row 1  1   2   NaN
row 2  5  10  20.0

In [1677]:
dict = {'A' : pd.Series([2,8,5,7], index=['p' , 'v' , 'a', 'k']),
        'B':  pd.Series([1, 2, 3, 4], index=['p', 'v', 'a', 'k'])}
df12=pd.DataFrame(dict)
df12

   A  B
p  2  1
v  8  2
a  5  3
k  7  4

In [1678]:
df12.drop(['A'] , axis=1,inplace=True)
df12

   B
p  1
v  2
a  3
k  4

In [1679]:
col1 = np.linspace(10, 100, 30)
col2 = np.random.randint(10,100,30)
df10 = pd.DataFrame({"C1" : col1 , "C2" :col2})
df10

            C1  C2
0    10.000000  73
1    13.103448  82
2    16.206897  92
3    19.310345  52
4    22.413793  21
5    25.517241  33
6    28.620690  10
7    31.724138  19
8    34.827586  53
9    37.931034  18
10   41.034483  14
11   44.137931  22
12   47.241379  29
13   50.344828  47
14   53.448276  66
15   56.551724  90
16   59.655172  22
17   62.758621  10
18   65.862069  18
19   68.965517  15
20   72.068966  41
21   75.172414  64
22   78.275862  92
23   81.379310  36
24   84.482759  30
25   87.586207  24
26   90.689655  53
27   93.793103  41
28   96.896552  76
29  100.000000  57

In [1680]:
df10 = df10.drop([17,18,19], axis=0)
df10

            C1  C2
0    10.000000  73
1    13.103448  82
2    16.206897  92
3    19.310345  52
4    22.413793  21
5    25.517241  33
6    28.620690  10
7    31.724138  19
8    34.827586  53
9    37.931034  18
10   41.034483  14
11   44.137931  22
12   47.241379  29
13   50.344828  47
14   53.448276  66
15   56.551724  90
16   59.655172  22
20   72.068966  41
21   75.172414  64
22   78.275862  92
23   81.379310  36
24   84.482759  30
25   87.586207  24
26   90.689655  53
27   93.793103  41
28   96.896552  76
29  100.000000  57

In [1681]:
df10.drop([16], axis=0,inplace=True)
df10

            C1  C2
0    10.000000  73
1    13.103448  82
2    16.206897  92
3    19.310345  52
4    22.413793  21
5    25.517241  33
6    28.620690  10
7    31.724138  19
8    34.827586  53
9    37.931034  18
10   41.034483  14
11   44.137931  22
12   47.241379  29
13   50.344828  47
14   53.448276  66
15   56.551724  90
20   72.068966  41
21   75.172414  64
22   78.275862  92
23   81.379310  36
24   84.482759  30
25   87.586207  24
26   90.689655  53
27   93.793103  41
28   96.896552  76
29  100.000000  57

In [1682]:
df10.drop(df10.index[5] , inplace=True)
df10

            C1  C2
0    10.000000  73
1    13.103448  82
2    16.206897  92
3    19.310345  52
4    22.413793  21
6    28.620690  10
7    31.724138  19
8    34.827586  53
9    37.931034  18
10   41.034483  14
11   44.137931  22
12   47.241379  29
13   50.344828  47
14   53.448276  66
15   56.551724  90
20   72.068966  41
21   75.172414  64
22   78.275862  92
23   81.379310  36
24   84.482759  30
25   87.586207  24
26   90.689655  53
27   93.793103  41
28   96.896552  76
29  100.000000  57

In [1683]:
df10 = df10.iloc[3:,]
df10

            C1  C2
3    19.310345  52
4    22.413793  21
6    28.620690  10
7    31.724138  19
8    34.827586  53
9    37.931034  18
10   41.034483  14
11   44.137931  22
12   47.241379  29
13   50.344828  47
14   53.448276  66
15   56.551724  90
20   72.068966  41
21   75.172414  64
22   78.275862  92
23   81.379310  36
24   84.482759  30
25   87.586207  24
26   90.689655  53
27   93.793103  41
28   96.896552  76
29  100.000000  57

In [1684]:
df10 = df10.iloc[:-4,]
df10

           C1  C2
3   19.310345  52
4   22.413793  21
6   28.620690  10
7   31.724138  19
8   34.827586  53
9   37.931034  18
10  41.034483  14
11  44.137931  22
12  47.241379  29
13  50.344828  47
14  53.448276  66
15  56.551724  90
20  72.068966  41
21  75.172414  64
22  78.275862  92
23  81.379310  36
24  84.482759  30
25  87.586207  24

In [1685]:
df10 = df10.iloc[:10,]
df10

           C1  C2
3   19.310345  52
4   22.413793  21
6   28.620690  10
7   31.724138  19
8   34.827586  53
9   37.931034  18
10  41.034483  14
11  44.137931  22
12  47.241379  29
13  50.344828  47

In [1686]:
df10.index[df10['C2'] == 52].tolist()

[3]

In [1687]:
df10.drop(df10.index[df10['C2'] == 52].tolist() , axis=0,inplace=True)
df10

           C1  C2
4   22.413793  21
6   28.620690  10
7   31.724138  19
8   34.827586  53
9   37.931034  18
10  41.034483  14
11  44.137931  22
12  47.241379  29
13  50.344828  47

In [1688]:
df10 = df10.drop(df10[df10["C2"]==78].index)
df10

           C1  C2
4   22.413793  21
6   28.620690  10
7   31.724138  19
8   34.827586  53
9   37.931034  18
10  41.034483  14
11  44.137931  22
12  47.241379  29
13  50.344828  47

In [1689]:
df10 = df10[df10.C2 != 14]
df10

           C1  C2
4   22.413793  21
6   28.620690  10
7   31.724138  19
8   34.827586  53
9   37.931034  18
11  44.137931  22
12  47.241379  29
13  50.344828  47

In [1690]:
df10 = df10[~(df10.C2.isin ([21,48]))]
df10

           C1  C2
6   28.620690  10
7   31.724138  19
8   34.827586  53
9   37.931034  18
11  44.137931  22
12  47.241379  29
13  50.344828  47

In [1691]:
df10 = df10[df10.C2.isin ([10,44])]
df10

         C1  C2
6  28.62069  10

In [1692]:
dict = {'A' : pd.Series([1, 2, 3,11],    index=['a', 'b', 'c','d']),
        'B' : pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd'])}

df11 = pd.DataFrame(dict)
df11

    A  B
a   1  1
b   2  2
c   3  3
d  11  4

In [1693]:
df11.drop("d", axis=0,inplace=True)
df11

   A  B
a  1  1
b  2  2
c  3  3

In [1694]:
df13 = pd.DataFrame({ 'ID' :[1,2,3,4] , 
                     'Name' :['Panshul' , 'Vikram' , 'Aggarwal' , 'is awesome'] , 
                     'location' : ['India' , 'Australia','UK' , 'US'] })
df13

   ID        Name   location
0   1     Panshul      India
1   2      Vikram  Australia
2   3    Aggarwal         UK
3   4  is awesome         US

In [1695]:
ind = df13[((df13.Name == 'Vikram') &(df13.ID == 2) & (df13.location == 'Australia'))].index
df13.drop(ind,inplace=True)
df13

   ID        Name location
0   1     Panshul    India
2   3    Aggarwal       UK
3   4  is awesome       US

In [1696]:
df

  PRG LANG  Rating
0     Java       1
1   Python       2
2        C       3
3      C++       4
4     Rust       5

In [1697]:
df.index = [1,2,3,4,5]
df

  PRG LANG  Rating
1     Java       1
2   Python       2
3        C       3
4      C++       4
5     Rust       5

In [1698]:
df.loc[1]

PRG LANG    Java
Rating         1
Name: 1, dtype: object

In [1699]:
df.iloc[1]

PRG LANG    Python
Rating           2
Name: 2, dtype: object

In [1700]:
df.loc[1:2]

  PRG LANG  Rating
1     Java       1
2   Python       2

In [1701]:
df.iloc[1:2]

  PRG LANG  Rating
2   Python       2

In [1702]:
df.loc[df.Rating > 2]

  PRG LANG  Rating
3        C       3
4      C++       4
5     Rust       5

In [1703]:
df1

     A
a  1.0
b  2.0
c  3.0
d  NaN

In [1704]:
df1.loc['a']

A    1.0
Name: a, dtype: float64

In [1705]:
dframe

                  C1        C2        C3        C4
2025-05-28  0.505168  0.448461  0.419602  0.916999
2025-05-29  0.455852  0.420722  0.886671  0.903959
2025-05-30  0.120185  0.892523  0.110257  0.847096
2025-05-31  0.812438  0.751182  0.320543  0.448607

In [1706]:
dframe['28-05-2025' : '30-05-2025' ]

                  C1        C2        C3        C4
2025-05-28  0.505168  0.448461  0.419602  0.916999
2025-05-29  0.455852  0.420722  0.886671  0.903959
2025-05-30  0.120185  0.892523  0.110257  0.847096

In [1707]:
dframe.loc[:,['C1' , 'C3']]

                  C1        C3
2025-05-28  0.505168  0.419602
2025-05-29  0.455852  0.886671
2025-05-30  0.120185  0.110257
2025-05-31  0.812438  0.320543

In [1708]:
dframe.loc['28-05-2025' : '30-05-2025',['C1' , 'C3']]

                  C1        C3
2025-05-28  0.505168  0.419602
2025-05-29  0.455852  0.886671
2025-05-30  0.120185  0.110257

In [1709]:
dframe[dframe['C1'] > 0.5]

                  C1        C2        C3        C4
2025-05-28  0.505168  0.448461  0.419602  0.916999
2025-05-31  0.812438  0.751182  0.320543  0.448607

In [1710]:
dframe[(dframe['C1'] > 0.5) & (dframe['C4'] > 0.5)]

                  C1        C2        C3        C4
2025-05-28  0.505168  0.448461  0.419602  0.916999

In [1711]:
dframe.iloc[0][0]

np.float64(0.5051678700583041)

In [1712]:
dframe.iloc[:,0:3]

                  C1        C2        C3
2025-05-28  0.505168  0.448461  0.419602
2025-05-29  0.455852  0.420722  0.886671
2025-05-30  0.120185  0.892523  0.110257
2025-05-31  0.812438  0.751182  0.320543

In [1713]:
dframe.iloc[0][0] = 10

In [1714]:
dframe[dframe['C1'].isin([10,20])]

              C1        C2        C3        C4
2025-05-28  10.0  0.448461  0.419602  0.916999

In [1715]:
dframe['C1'] = 2857
dframe

              C1        C2        C3        C4
2025-05-28  2857  0.448461  0.419602  0.916999
2025-05-29  2857  0.420722  0.886671  0.903959
2025-05-30  2857  0.892523  0.110257  0.847096
2025-05-31  2857  0.751182  0.320543  0.448607

In [1716]:
dframe.iat[0,2] = 4022
dframe

              C1        C2           C3        C4
2025-05-28  2857  0.448461  4022.000000  0.916999
2025-05-29  2857  0.420722     0.886671  0.903959
2025-05-30  2857  0.892523     0.110257  0.847096
2025-05-31  2857  0.751182     0.320543  0.448607

In [1717]:
dframe1 = dframe.copy(deep=True)

In [1718]:
dframe1[(dframe1['C1'] > 0.5) & (dframe1['C4'] > 0.5)] = 0
dframe1[dframe1['C1'] == 0]

            C1   C2   C3   C4
2025-05-28   0  0.0  0.0  0.0
2025-05-29   0  0.0  0.0  0.0
2025-05-30   0  0.0  0.0  0.0

In [1719]:
dframe1[dframe1['C1'].isin([0])] = 99
dframe1

              C1         C2         C3         C4
2025-05-28    99  99.000000  99.000000  99.000000
2025-05-29    99  99.000000  99.000000  99.000000
2025-05-30    99  99.000000  99.000000  99.000000
2025-05-31  2857   0.751182   0.320543   0.448607

In [1720]:
dframe

              C1        C2           C3        C4
2025-05-28  2857  0.448461  4022.000000  0.916999
2025-05-29  2857  0.420722     0.886671  0.903959
2025-05-30  2857  0.892523     0.110257  0.847096
2025-05-31  2857  0.751182     0.320543  0.448607

In [1721]:
dframe1[dframe1['C1'] == 99]

            C1    C2    C3    C4
2025-05-28  99  99.0  99.0  99.0
2025-05-29  99  99.0  99.0  99.0
2025-05-30  99  99.0  99.0  99.0

In [1722]:
dframe.notna()

              C1    C2    C3    C4
2025-05-28  True  True  True  True
2025-05-29  True  True  True  True
2025-05-30  True  True  True  True
2025-05-31  True  True  True  True

In [1723]:
dframe.isna()

               C1     C2     C3     C4
2025-05-28  False  False  False  False
2025-05-29  False  False  False  False
2025-05-30  False  False  False  False
2025-05-31  False  False  False  False

In [1724]:
dframe = dframe.fillna(1020)
dframe

              C1        C2           C3        C4
2025-05-28  2857  0.448461  4022.000000  0.916999
2025-05-29  2857  0.420722     0.886671  0.903959
2025-05-30  2857  0.892523     0.110257  0.847096
2025-05-31  2857  0.751182     0.320543  0.448607

In [1725]:
dframe.mean()

C1    2857.000000
C2       0.628222
C3    1005.829368
C4       0.779165
dtype: float64

In [1726]:
dframe.max()

C1    2857.000000
C2       0.892523
C3    4022.000000
C4       0.916999
dtype: float64

In [1727]:
dframe.min()

C1    2857.000000
C2       0.420722
C3       0.110257
C4       0.448607
dtype: float64

In [1728]:
dframe.median()

C1    2857.000000
C2       0.599822
C3       0.603607
C4       0.875528
dtype: float64

In [1729]:
dframe.std()

C1       0.000000
C2       0.231189
C3    2010.780448
C4       0.222452
dtype: float64

In [1730]:
dframe.var()

C1    0.000000e+00
C2    5.344818e-02
C3    4.043238e+06
C4    4.948489e-02
dtype: float64

In [1731]:
dframe.quantile(0.25)

C1    2857.000000
C2       0.441526
C3       0.267971
C4       0.747474
Name: 0.25, dtype: float64

In [1732]:
dframe.quantile(0.50)

C1    2857.000000
C2       0.599822
C3       0.603607
C4       0.875528
Name: 0.5, dtype: float64

In [1733]:
dframe.quantile(0.75)

C1    2857.000000
C2       0.786517
C3    1006.165003
C4       0.907219
Name: 0.75, dtype: float64

In [1734]:
dframe.quantile(0.75) - dframe.quantile(0.25)

C1       0.000000
C2       0.344991
C3    1005.897032
C4       0.159745
dtype: float64

In [1735]:
dframe.sum()

C1    11428.000000
C2        2.512889
C3     4023.317471
C4        3.116661
dtype: float64

In [1736]:
dframe.describe()

           C1        C2           C3        C4
count     4.0  4.000000     4.000000  4.000000
mean   2857.0  0.628222  1005.829368  0.779165
std       0.0  0.231189  2010.780448  0.222452
min    2857.0  0.420722     0.110257  0.448607
25%    2857.0  0.441526     0.267971  0.747474
50%    2857.0  0.599822     0.603607  0.875528
75%    2857.0  0.786517  1006.165003  0.907219
max    2857.0  0.892523  4022.000000  0.916999

In [1737]:
dframe.skew()

C1    0.000000
C2    0.300991
C3    2.000000
C4   -1.892202
dtype: float64

In [1738]:
dframe.kurt()

C1    0.000000
C2   -4.157827
C3    3.999999
C4    3.603078
dtype: float64

In [1739]:
dframe.corr()

    C1        C2        C3        C4
C1 NaN       NaN       NaN       NaN
C2 NaN  1.000000 -0.518507 -0.475503
C3 NaN -0.518507  1.000000  0.413127
C4 NaN -0.475503  0.413127  1.000000

In [1740]:
dframe.cov()

     C1          C2            C3          C4
C1  0.0    0.000000  0.000000e+00    0.000000
C2  0.0    0.053448 -2.410383e+02   -0.024454
C3  0.0 -241.038343  4.043238e+06  184.792529
C4  0.0   -0.024454  1.847925e+02    0.049485

In [1741]:
st.mean(dframe['C2'])

0.6282221632256967

In [1742]:
st.harmonic_mean(dframe['C2'])

0.5667032837019322

In [1743]:
arr = np.array([1,2,3,4,5,6,7,8])
st.median(arr)

np.float64(4.5)

In [1744]:
st.median_low(arr)

np.int64(4)

In [1745]:
st.median_high(arr)

np.int64(5)

In [1746]:
st.mode(dframe['C4'])

0.9169985569292698

In [1747]:
st.variance(dframe['C3'])

4043238.0110871214

In [1748]:
st.pvariance(dframe['C2'])

0.04008613311647108

In [1749]:
st.stdev(dframe['C2'])

0.23118861885618008

In [1750]:
st.pstdev(dframe['C2'])

0.20021521699529005

In [1751]:
dframe

              C1        C2           C3        C4
2025-05-28  2857  0.448461  4022.000000  0.916999
2025-05-29  2857  0.420722     0.886671  0.903959
2025-05-30  2857  0.892523     0.110257  0.847096
2025-05-31  2857  0.751182     0.320543  0.448607

In [1752]:
dframe.apply(max)

C1    2857.000000
C2       0.892523
C3    4022.000000
C4       0.916999
dtype: float64

In [1753]:
dframe.apply(min)

C1    2857.000000
C2       0.420722
C3       0.110257
C4       0.448607
dtype: float64

In [1754]:
dframe.apply(sum)

C1    11428.000000
C2        2.512889
C3     4023.317471
C4        3.116661
dtype: float64

In [1755]:
dframe.apply(np.sum)

C1    11428.000000
C2        2.512889
C3     4023.317471
C4        3.116661
dtype: float64

In [1756]:
dframe.apply(np.sum ,axis=1)

2025-05-28    6880.365460
2025-05-29    2859.211352
2025-05-30    2858.849876
2025-05-31    2858.520332
Freq: D, dtype: float64

In [1757]:
dframe.applymap(np.sqrt)

                   C1        C2         C3        C4
2025-05-28  53.450912  0.669672  63.419240  0.957600
2025-05-29  53.450912  0.648631   0.941632  0.950768
2025-05-30  53.450912  0.944734   0.332049  0.920378
2025-05-31  53.450912  0.866708   0.566165  0.669782

In [1758]:
dframe.applymap(math.sqrt)

                   C1        C2         C3        C4
2025-05-28  53.450912  0.669672  63.419240  0.957600
2025-05-29  53.450912  0.648631   0.941632  0.950768
2025-05-30  53.450912  0.944734   0.332049  0.920378
2025-05-31  53.450912  0.866708   0.566165  0.669782

In [1759]:
dframe.applymap(float)

                C1        C2           C3        C4
2025-05-28  2857.0  0.448461  4022.000000  0.916999
2025-05-29  2857.0  0.420722     0.886671  0.903959
2025-05-30  2857.0  0.892523     0.110257  0.847096
2025-05-31  2857.0  0.751182     0.320543  0.448607

In [1760]:
dframe.apply(lambda x: min(x))

C1    2857.000000
C2       0.420722
C3       0.110257
C4       0.448607
dtype: float64

In [1761]:
dframe.apply(lambda x: x*x)

                 C1        C2            C3        C4
2025-05-28  8162449  0.201117  1.617648e+07  0.840886
2025-05-29  8162449  0.177007  7.861855e-01  0.817142
2025-05-30  8162449  0.796598  1.215658e-02  0.717572
2025-05-31  8162449  0.564275  1.027478e-01  0.201249

In [1762]:
daf1 =  pd.DataFrame ({'id': ['1', '2', '3', '4', '5'], 'Name': ['Panshul', 'Vikram', 'Aggarwal', 'is', 'awesome']})
daf1

  id      Name
0  1   Panshul
1  2    Vikram
2  3  Aggarwal
3  4        is
4  5   awesome

In [1763]:
daf2 =  pd.DataFrame ({'id': ['1', '2', '6', '7', '8'], 'Score': [40 , 60 , 80 , 90 , 70]})
daf2

  id  Score
0  1     40
1  2     60
2  6     80
3  7     90
4  8     70

In [1764]:
daf2 =  pd.DataFrame ({'id': ['1', '2', '6', '7', '8'], 'Score': [40 , 60 , 80 , 90 , 70]})
daf2

  id  Score
0  1     40
1  2     60
2  6     80
3  7     90
4  8     70

In [1765]:
pd.merge(daf1, daf2, on='id', how='inner')

  id     Name  Score
0  1  Panshul     40
1  2   Vikram     60

In [1766]:
pd.merge(daf1, daf2, on='id', how='outer')

  id      Name  Score
0  1   Panshul   40.0
1  2    Vikram   60.0
2  3  Aggarwal    NaN
3  4        is    NaN
4  5   awesome    NaN
5  6       NaN   80.0
6  7       NaN   90.0
7  8       NaN   70.0

In [1767]:
pd.merge(daf1, daf2, on='id', how='left')

  id      Name  Score
0  1   Panshul   40.0
1  2    Vikram   60.0
2  3  Aggarwal    NaN
3  4        is    NaN
4  5   awesome    NaN

In [1768]:
pd.merge(daf1, daf2, on='id', how='right')

  id     Name  Score
0  1  Panshul     40
1  2   Vikram     60
2  6      NaN     80
3  7      NaN     90
4  8      NaN     70

In [1769]:
df2 = pd.read_csv('Pokemon.csv')
df2.head(5)

,#,Name,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
0,1,Bulbasaur,Grass,Poison,318,45,49,49,65,65,45,1,False
1,2,Ivysaur,Grass,Poison,405,60,62,63,80,80,60,1,False
2,3,Venusaur,Grass,Poison,525,80,82,83,100,100,80,1,False
3,3,VenusaurMega Venusaur,Grass,Poison,625,80,100,123,122,120,80,1,False
4,4,Charmander,Fire,NaN,309,39,52,43,60,50,65,1,False

In [1770]:
df2['Total'] = df2['HP'] + df2['Attack']
df2.head(5)

,#,Name,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
0,1,Bulbasaur,Grass,Poison,94,45,49,49,65,65,45,1,False
1,2,Ivysaur,Grass,Poison,122,60,62,63,80,80,60,1,False
2,3,Venusaur,Grass,Poison,162,80,82,83,100,100,80,1,False
3,3,VenusaurMega Venusaur,Grass,Poison,180,80,100,123,122,120,80,1,False
4,4,Charmander,Fire,NaN,91,39,52,43,60,50,65,1,False

In [1771]:
df2['Total'] = df2.iloc[:,4:10].sum(axis=1)
df2.head(5)

,#,Name,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
0,1,Bulbasaur,Grass,Poison,367,45,49,49,65,65,45,1,False
1,2,Ivysaur,Grass,Poison,467,60,62,63,80,80,60,1,False
2,3,Venusaur,Grass,Poison,607,80,82,83,100,100,80,1,False
3,3,VenusaurMega Venusaur,Grass,Poison,725,80,100,123,122,120,80,1,False
4,4,Charmander,Fire,NaN,335,39,52,43,60,50,65,1,False

In [1772]:
cols = list(df2.columns)

df2 = df2[cols[0:10] + [cols[-1]] + cols[10:12]]
df2.head(5)

,#,Name,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Legendary,Speed,Generation
0,1,Bulbasaur,Grass,Poison,367,45,49,49,65,65,False,45,1
1,2,Ivysaur,Grass,Poison,467,60,62,63,80,80,False,60,1
2,3,Venusaur,Grass,Poison,607,80,82,83,100,100,False,80,1
3,3,VenusaurMega Venusaur,Grass,Poison,725,80,100,123,122,120,False,80,1
4,4,Charmander,Fire,NaN,335,39,52,43,60,50,False,65,1

In [1773]:
cols = list(df2.columns)

df2 = df2[cols[0:10] + [cols[-1]] + cols[10:12]]
df2.head(5)

,#,Name,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Generation,Legendary,Speed
0,1,Bulbasaur,Grass,Poison,367,45,49,49,65,65,1,False,45
1,2,Ivysaur,Grass,Poison,467,60,62,63,80,80,1,False,60
2,3,Venusaur,Grass,Poison,607,80,82,83,100,100,1,False,80
3,3,VenusaurMega Venusaur,Grass,Poison,725,80,100,123,122,120,1,False,80
4,4,Charmander,Fire,NaN,335,39,52,43,60,50,1,False,65

In [1774]:
cols = list(df2.columns)

df2 = df2[cols[0:10] + [cols[12]] + cols[10:12]]
df2.head(5)

,#,Name,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
0,1,Bulbasaur,Grass,Poison,367,45,49,49,65,65,45,1,False
1,2,Ivysaur,Grass,Poison,467,60,62,63,80,80,60,1,False
2,3,Venusaur,Grass,Poison,607,80,82,83,100,100,80,1,False
3,3,VenusaurMega Venusaur,Grass,Poison,725,80,100,123,122,120,80,1,False
4,4,Charmander,Fire,NaN,335,39,52,43,60,50,65,1,False

In [1775]:
df2.to_csv('poke_updated.csv')

In [1776]:
df2.to_csv('poke_updated1.csv', index=False)

In [1777]:
df2.head(10)

,#,Name,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
0,1,Bulbasaur,Grass,Poison,367,45,49,49,65,65,45,1,False
1,2,Ivysaur,Grass,Poison,467,60,62,63,80,80,60,1,False
2,3,Venusaur,Grass,Poison,607,80,82,83,100,100,80,1,False
3,3,VenusaurMega Venusaur,Grass,Poison,725,80,100,123,122,120,80,1,False
4,4,Charmander,Fire,NaN,335,39,52,43,60,50,65,1,False
5,5,Charmeleon,Fire,NaN,447,58,64,58,80,65,80,1,False
6,6,Charizard,Fire,Flying,596,78,84,78,109,85,100,1,False
7,6,CharizardMega Charizard X,Fire,Dragon,742,78,130,111,130,85,100,1,False
8,6,CharizardMega Charizard Y,Fire,Flying,716,78,104,78,159,115,100,1,False
9,7,Squirtle,Water,NaN,363,44,48,65,50,64,43,1,False

In [1778]:
df2.to_csv('poke.txt' , sep='\t' , index=False)

In [1779]:
df2.to_excel('poke.xlsx')

In [1780]:
df2.to_excel('poke.xlsx', index=0)

In [1781]:
df3 = df2.loc[(df2['Type 2'] == 'Dragon') & (df2['Type 1'] == 'Dark')]
df3

,#,Name,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
694,633,Deino,Dark,Dragon,379,52,65,50,45,50,38,5,False
695,634,Zweilous,Dark,Dragon,519,72,85,70,65,70,58,5,False
696,635,Hydreigon,Dark,Dragon,699,92,105,90,125,90,98,5,False

In [1782]:
df4 = df3.reset_index()
df4

,index,#,Name,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
0,694,633,Deino,Dark,Dragon,379,52,65,50,45,50,38,5,False
1,695,634,Zweilous,Dark,Dragon,519,72,85,70,65,70,58,5,False
2,696,635,Hydreigon,Dark,Dragon,699,92,105,90,125,90,98,5,False

In [1783]:
df4 = df3.reset_index()
df4

,index,#,Name,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
0,694,633,Deino,Dark,Dragon,379,52,65,50,45,50,38,5,False
1,695,634,Zweilous,Dark,Dragon,519,72,85,70,65,70,58,5,False
2,696,635,Hydreigon,Dark,Dragon,699,92,105,90,125,90,98,5,False

In [1784]:
df3.reset_index(drop=True , inplace=True)
df3

,#,Name,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
0,633,Deino,Dark,Dragon,379,52,65,50,45,50,38,5,False
1,634,Zweilous,Dark,Dragon,519,72,85,70,65,70,58,5,False
2,635,Hydreigon,Dark,Dragon,699,92,105,90,125,90,98,5,False

In [1785]:
df2.head(10)

,#,Name,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
0,1,Bulbasaur,Grass,Poison,367,45,49,49,65,65,45,1,False
1,2,Ivysaur,Grass,Poison,467,60,62,63,80,80,60,1,False
2,3,Venusaur,Grass,Poison,607,80,82,83,100,100,80,1,False
3,3,VenusaurMega Venusaur,Grass,Poison,725,80,100,123,122,120,80,1,False
4,4,Charmander,Fire,NaN,335,39,52,43,60,50,65,1,False
5,5,Charmeleon,Fire,NaN,447,58,64,58,80,65,80,1,False
6,6,Charizard,Fire,Flying,596,78,84,78,109,85,100,1,False
7,6,CharizardMega Charizard X,Fire,Dragon,742,78,130,111,130,85,100,1,False
8,6,CharizardMega Charizard Y,Fire,Flying,716,78,104,78,159,115,100,1,False
9,7,Squirtle,Water,NaN,363,44,48,65,50,64,43,1,False